answer_examples = [
    {
        "input": "메타세미나는 무엇인가요?",
        "answer": """메타세미나는 3D 가상공간에서 열리는 세미나입니다.
        현재는 주로 의학분야의 심포지엄이나 제약회사의 신제품 발표에 사용되고 있으며
        마이원에 제작한 가상세미나 플랫폼입니다.
        """,
    },
    #     {
    #         "input": "엔허투의 용법 용량은요?",
    #         "answer": """엔허투는 아래와 같은 방식으로 사용되고 있어요:
    # 1. 환자 선정 기준
    # 유방암 환자의 경우, HER2 발현 정도가 IHC 1+ 또는 IHC 2+/ISH-일 때, 절제할 수 없거나 전이된 경우에 사용됩니다.
    # 비소세포폐암 환자는 HER2(ERBB2) 돌연변이가 활성화되어 있어야 하고, 수술이 어렵거나 이미 암이 퍼진 경우에 사용됩니다.
    # 치료를 시작하기 전에는 신뢰할 수 있는 검사 방법으로 HER2 상태를 꼭 확인해야 해요.
    # 2. 치료 전 준비 (전처치)
    # 이 약은 오심이나 구토를 유발할 수 있기 때문에, 미리 예방약을 함께 사용해야 합니다. 예를 들어, 5-HT3 수용체 길항제, NK1 수용체 길항제, 덱사메타손 같은 약들을 조합해서 전처치해요.
    # 3. 투약 방법
    # 첫 투여는 정맥에 90분간 천천히 주입하고, 문제가 없었다면 그다음부터는 30분 정도로 속도를 줄여 투약할 수 있어요.
    # 투여 중 불편함이나 반응이 있으면 속도를 조절하거나 중단할 수 있고, 심한 반응이 생기면 치료를 완전히 중단해야 해요.
    # 4. 권장 용량
    # 유방암 및 비소세포폐암:
    # 3주에 한 번씩, 5.4mg/kg을 정맥에 주입해요.
    # 위암:
    # 마찬가지로 3주에 한 번, 6.4mg/kg을 정맥에 투여합니다.
    # 치료는 병의 진행이나 부작용 정도에 따라 계속하거나 중단하게 됩니다.
    # 5. 용량 조절
    # 이상 반응이 나타날 경우, 일시 중단하거나 용량을 줄이는 방식으로 대응합니다.
    # 한 번 줄인 용량은 다시 늘리지 않아요."""
    #     },
]
